#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.stackx-cluster.data.aws_partition.current: Reading...
module.stackx-cluster.data.aws_iam_policy_document.tr: Reading...
module.stackx-network.data.aws_region.current: Reading...
module.stackx-cluster.data.aws_caller_identity.current: Reading...
module.stackx-network.data.aws_availability_zones.available: Reading...
module.stackx-cluster.data.aws_region.current: Reading...
module.stackx-cluster.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.stackx-network.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.stackx-cluster.data.aws_partition.current: Read complete after 0s [id=aws]
module.stackx-cluster.data.aws_iam_policy_document.tr: Read complete after 0s [id=3552664922]
module.stackx-cluster.data.aws_caller_identity.current: Read complete after 0s [id=842825652921]
module.stackx-cluster.data.aws_iam_session_context.current: Reading...
module.stackx-cluster.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:sts::842825652921:assumed-role/github-actions/GitHubActions]
module.stackx-network.data.aws_availability_zones.available: Read complete after 0s [id=eu-central-1]
module.stackx-network.data.aws_availability_zone.all[1]: Reading...
module.stackx-network.data.aws_availability_zone.all[2]: Reading...
module.stackx-network.data.aws_availability_zone.all[0]: Reading...
module.stackx-network.data.aws_availability_zone.all[1]: Read complete after 1s [id=eu-central-1b]
module.stackx-network.data.aws_availability_zone.all[2]: Read complete after 1s [id=eu-central-1c]
module.stackx-network.data.aws_availability_zone.all[0]: Read complete after 1s [id=eu-central-1a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.stackx-cluster.data.aws_eks_addon_version.kube_proxy[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "kube_proxy" {
      + addon_name         = "kube-proxy"
      + id                 = (known after apply)
      + kubernetes_version = "1.27"
      + most_recent        = true
      + version            = (known after apply)
    }

  # module.stackx-cluster.data.aws_eks_addon_version.vpc_cni[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "vpc_cni" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.27"
      + most_recent        = true
      + version            = (known after apply)
    }

  # module.stackx-cluster.data.aws_eks_cluster_auth.cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster_auth" "cluster" {
      + id    = (known after apply)
      + name  = "stackx-cluster-f2f6c971-6a3c-4d"
      + token = (sensitive value)
    }

  # module.stackx-cluster.data.aws_iam_policy_document.eks_secrets_encryption[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "eks_secrets_encryption" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "kms:CreateGrant",
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "Allow access for all principals in the account that are authorized"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "842825652921",
                ]
              + variable = "kms:CallerAccount"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "eks.eu-central-1.amazonaws.com",
                ]
              + variable = "kms:ViaService"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::842825652921:root",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:Describe*",
              + "kms:Get*",
              + "kms:List*",
              + "kms:RevokeGrant",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "Allow direct access to key metadata to the account"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::842825652921:root",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "Allow access for Key Administrators"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::842825652921:role/github-actions",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "Allow use of the key"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:CreateGrant",
              + "kms:ListGrants",
              + "kms:RevokeGrant",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "Allow attachment of persistent resources"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "true",
                ]
              + variable = "kms:GrantIsForAWSResource"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.stackx-cluster.data.aws_iam_policy_document.vpc_cni[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "vpc_cni" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-node",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.stackx-cluster.data.tls_certificate.oidc will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "oidc" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.stackx-cluster.aws_cloudwatch_log_group.eks_cluster will be created
  + resource "aws_cloudwatch_log_group" "eks_cluster" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/eks/stackx-cluster-f2f6c971-6a3c-4d-f2f6c971-6a3c-4d6e-9dca-7a3ba454d64d/cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags              = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-cluster"
          + "Module"   = "terraform-aws-stackx-cluster"
          + "examples" = "example"
        }
      + tags_all          = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-cluster"
          + "Module"   = "terraform-aws-stackx-cluster"
          + "examples" = "example"
        }
    }

  # module.stackx-cluster.aws_ec2_tag.cluster_security_group["Github"] will be created
  + resource "aws_ec2_tag" "cluster_security_group" {
      + id          = (known after apply)
      + key         = "Github"
      + resource_id = (known after apply)
      + value       = "https://github.com/ventx/terraform-aws-stackx-cluster"
    }

  # module.stackx-cluster.aws_ec2_tag.cluster_security_group["Module"] will be created
  + resource "aws_ec2_tag" "cluster_security_group" {
      + id          = (known after apply)
      + key         = "Module"
      + resource_id = (known after apply)
      + value       = "terraform-aws-stackx-cluster"
    }

  # module.stackx-cluster.aws_ec2_tag.cluster_security_group["examples"] will be created
  + resource "aws_ec2_tag" "cluster_security_group" {
      + id          = (known after apply)
      + key         = "examples"
      + resource_id = (known after apply)
      + value       = "example"
    }

  # module.stackx-cluster.aws_ec2_tag.cluster_security_group["karpenter.sh/discovery"] will be created
  + resource "aws_ec2_tag" "cluster_security_group" {
      + id          = (known after apply)
      + key         = "karpenter.sh/discovery"
      + resource_id = (known after apply)
      + value       = "stackx-cluster-f2f6c971-6a3c-4d"
    }

  # module.stackx-cluster.aws_eks_addon.kube_proxy[0] will be created
  + resource "aws_eks_addon" "kube_proxy" {
      + addon_name                  = "kube-proxy"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "stackx-cluster-f2f6c971-6a3c-4d"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + tags                        = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-cluster"
          + "Module"   = "terraform-aws-stackx-cluster"
          + "examples" = "example"
        }
      + tags_all                    = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-cluster"
          + "Module"   = "terraform-aws-stackx-cluster"
          + "examples" = "example"
        }
    }

  # module.stackx-cluster.aws_eks_addon.vpc_cni[0] will be created
  + resource "aws_eks_addon" "vpc_cni" {
      + addon_name                  = "vpc-cni"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "stackx-cluster-f2f6c971-6a3c-4d"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + service_account_role_arn    = (known after apply)
      + tags                        = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-cluster"
          + "Module"   = "terraform-aws-stackx-cluster"
          + "examples" = "example"
        }
      + tags_all                    = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-cluster"
          + "Module"   = "terraform-aws-stackx-cluster"
          + "examples" = "example"
        }
    }

  # module.stackx-cluster.aws_eks_cluster.cluster will be created
  + resource "aws_eks_cluster" "cluster" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "stackx-cluster-f2f6c971-6a3c-4d"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-cluster"
          + "Module"   = "terraform-aws-stackx-cluster"
          + "examples" = "example"
        }
      + tags_all                  = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-cluster"
          + "Module"   = "terraform-aws-stackx-cluster"
          + "examples" = "example"
        }
      + version                   = "1.27"

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = "172.16.0.0/12"
          + service_ipv6_cidr = (known after apply)
        }

      + timeouts {
          + create = "30m"
          + delete = "15m"
          + update = "60m"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.stackx-cluster.aws_iam_openid_connect_provider.irsa will be created
  + resource "aws_iam_openid_connect_provider" "irsa" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-cluster"
          + "Module"   = "terraform-aws-stackx-cluster"
          + "examples" = "example"
        }
      + tags_all        = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-cluster"
          + "Module"   = "terraform-aws-stackx-cluster"
          + "examples" = "example"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.stackx-cluster.aws_iam_role.eks_cluster will be created
  + resource "aws_iam_role" "eks_cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-cluster-stackx-cluster-f2f6c971-6a3c-4d-f2f6c971-6a3c-4d6e-"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-cluster"
          + "Module"   = "terraform-aws-stackx-cluster"
          + "examples" = "example"
        }
      + tags_all              = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-cluster"
          + "Module"   = "terraform-aws-stackx-cluster"
          + "examples" = "example"
        }
      + unique_id             = (known after apply)
    }

  # module.stackx-cluster.aws_iam_role.vpc_cni[0] will be created
  + resource "aws_iam_role" "vpc_cni" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "amazoneks_cni_role-stackx-cluster-f2f6c971-6a3c-4d-f2f6c971-6a3"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-cluster"
          + "Module"   = "terraform-aws-stackx-cluster"
          + "examples" = "example"
        }
      + tags_all              = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-cluster"
          + "Module"   = "terraform-aws-stackx-cluster"
          + "examples" = "example"
        }
      + unique_id             = (known after apply)
    }

  # module.stackx-cluster.aws_iam_role_policy_attachment.attach["AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-cluster-stackx-cluster-f2f6c971-6a3c-4d-f2f6c971-6a3c-4d6e-"
    }

  # module.stackx-cluster.aws_iam_role_policy_attachment.attach["AmazonEKSServicePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = "eks-cluster-stackx-cluster-f2f6c971-6a3c-4d-f2f6c971-6a3c-4d6e-"
    }

  # module.stackx-cluster.aws_iam_role_policy_attachment.attach["AmazonEKSVPCResourceController"] will be created
  + resource "aws_iam_role_policy_attachment" "attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "eks-cluster-stackx-cluster-f2f6c971-6a3c-4d-f2f6c971-6a3c-4d6e-"
    }

  # module.stackx-cluster.aws_iam_role_policy_attachment.example[0] will be created
  + resource "aws_iam_role_policy_attachment" "example" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "amazoneks_cni_role-stackx-cluster-f2f6c971-6a3c-4d-f2f6c971-6a3"
    }

  # module.stackx-cluster.aws_kms_alias.eks_secrets_encryption[0] will be created
  + resource "aws_kms_alias" "eks_secrets_encryption" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/stackx-cluster-f2f6c971-6a3c-4d"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.stackx-cluster.aws_kms_key.eks_secrets_encryption[0] will be created
  + resource "aws_kms_key" "eks_secrets_encryption" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "AWS KMS key for encrypting and decrypting EKS secrets at-rest"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags                               = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-cluster"
          + "Module"   = "terraform-aws-stackx-cluster"
          + "examples" = "example"
        }
      + tags_all                           = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-cluster"
          + "Module"   = "terraform-aws-stackx-cluster"
          + "examples" = "example"
        }
    }

  # module.stackx-network.aws_egress_only_internet_gateway.ipv6[0] will be created
  + resource "aws_egress_only_internet_gateway" "ipv6" {
      + id       = (known after apply)
      + tags_all = (known after apply)
      + vpc_id   = (known after apply)
    }

  # module.stackx-network.aws_eip.eip[0] will be created
  + resource "aws_eip" "eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Access"                          = "private"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + tags_all             = {
          + "Access"                          = "private"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + vpc                  = (known after apply)
    }

  # module.stackx-network.aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-network"
          + "Module"   = "terraform-aws-stackx-network"
          + "Name"     = "stackx-0-network"
          + "deleteme" = "true"
          + "test"     = "true"
        }
      + tags_all = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-network"
          + "Module"   = "terraform-aws-stackx-network"
          + "Name"     = "stackx-0-network"
          + "deleteme" = "true"
          + "test"     = "true"
        }
      + vpc_id   = (known after apply)
    }

  # module.stackx-network.aws_nat_gateway.natgw[0] will be created
  + resource "aws_nat_gateway" "natgw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Access"                          = "private"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + tags_all                           = {
          + "Access"                          = "private"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
    }

  # module.stackx-network.aws_route.private_ipv6_egress["a"] will be created
  + resource "aws_route" "private_ipv6_egress" {
      + destination_ipv6_cidr_block = "::/0"
      + egress_only_gateway_id      = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.stackx-network.aws_route.private_ipv6_egress["b"] will be created
  + resource "aws_route" "private_ipv6_egress" {
      + destination_ipv6_cidr_block = "::/0"
      + egress_only_gateway_id      = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.stackx-network.aws_route.private_ipv6_egress["c"] will be created
  + resource "aws_route" "private_ipv6_egress" {
      + destination_ipv6_cidr_block = "::/0"
      + egress_only_gateway_id      = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.stackx-network.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.stackx-network.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.stackx-network.aws_route.public_internet_gateway_ipv6["a"] will be created
  + resource "aws_route" "public_internet_gateway_ipv6" {
      + destination_ipv6_cidr_block = "::/0"
      + egress_only_gateway_id      = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.stackx-network.aws_route.public_internet_gateway_ipv6["b"] will be created
  + resource "aws_route" "public_internet_gateway_ipv6" {
      + destination_ipv6_cidr_block = "::/0"
      + egress_only_gateway_id      = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.stackx-network.aws_route.public_internet_gateway_ipv6["c"] will be created
  + resource "aws_route" "public_internet_gateway_ipv6" {
      + destination_ipv6_cidr_block = "::/0"
      + egress_only_gateway_id      = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.stackx-network.aws_route_table.private["a"] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Access"                          = "private"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + tags_all         = {
          + "Access"                          = "private"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + vpc_id           = (known after apply)
    }

  # module.stackx-network.aws_route_table.private["b"] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Access"                          = "private"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + tags_all         = {
          + "Access"                          = "private"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + vpc_id           = (known after apply)
    }

  # module.stackx-network.aws_route_table.private["c"] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Access"                          = "private"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + tags_all         = {
          + "Access"                          = "private"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + vpc_id           = (known after apply)
    }

  # module.stackx-network.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Access"                       = "public"
          + "deleteme"                     = "true"
          + "kubernetes.io/cluster/stackx" = "shared"
          + "kubernetes.io/role/elb"       = "1"
          + "managedby"                    = "terratest"
          + "owner"                        = "terraform-aws-terratest"
          + "project"                      = "stackx"
          + "test"                         = "true"
          + "workspace"                    = "terratest"
        }
      + tags_all         = {
          + "Access"                       = "public"
          + "deleteme"                     = "true"
          + "kubernetes.io/cluster/stackx" = "shared"
          + "kubernetes.io/role/elb"       = "1"
          + "managedby"                    = "terratest"
          + "owner"                        = "terraform-aws-terratest"
          + "project"                      = "stackx"
          + "test"                         = "true"
          + "workspace"                    = "terratest"
        }
      + vpc_id           = (known after apply)
    }

  # module.stackx-network.aws_route_table_association.private["a"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.stackx-network.aws_route_table_association.private["b"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.stackx-network.aws_route_table_association.private["c"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.stackx-network.aws_route_table_association.public["a"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.stackx-network.aws_route_table_association.public["b"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.stackx-network.aws_route_table_association.public["c"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.stackx-network.aws_subnet.private["a"] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.0.0/18"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Access"                          = "private"
          + "Name"                            = "private-eu-central-1a"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + tags_all                                       = {
          + "Access"                          = "private"
          + "Name"                            = "private-eu-central-1a"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + vpc_id                                         = (known after apply)

      + timeouts {
          + delete = "30m"
        }
    }

  # module.stackx-network.aws_subnet.private["b"] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.64.0/18"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Access"                          = "private"
          + "Name"                            = "private-eu-central-1b"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + tags_all                                       = {
          + "Access"                          = "private"
          + "Name"                            = "private-eu-central-1b"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + vpc_id                                         = (known after apply)

      + timeouts {
          + delete = "30m"
        }
    }

  # module.stackx-network.aws_subnet.private["c"] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.128.0/18"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Access"                          = "private"
          + "Name"                            = "private-eu-central-1c"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + tags_all                                       = {
          + "Access"                          = "private"
          + "Name"                            = "private-eu-central-1c"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + vpc_id                                         = (known after apply)

      + timeouts {
          + delete = "30m"
        }
    }

  # module.stackx-network.aws_subnet.public["a"] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.192.0/22"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Access"                       = "public"
          + "Name"                         = "public-eu-central-1a"
          + "deleteme"                     = "true"
          + "kubernetes.io/cluster/stackx" = "shared"
          + "kubernetes.io/role/elb"       = "1"
          + "managedby"                    = "terratest"
          + "owner"                        = "terraform-aws-terratest"
          + "project"                      = "stackx"
          + "test"                         = "true"
          + "workspace"                    = "terratest"
        }
      + tags_all                                       = {
          + "Access"                       = "public"
          + "Name"                         = "public-eu-central-1a"
          + "deleteme"                     = "true"
          + "kubernetes.io/cluster/stackx" = "shared"
          + "kubernetes.io/role/elb"       = "1"
          + "managedby"                    = "terratest"
          + "owner"                        = "terraform-aws-terratest"
          + "project"                      = "stackx"
          + "test"                         = "true"
          + "workspace"                    = "terratest"
        }
      + vpc_id                                         = (known after apply)

      + timeouts {
          + delete = "30m"
        }
    }

  # module.stackx-network.aws_subnet.public["b"] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.196.0/22"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Access"                       = "public"
          + "Name"                         = "public-eu-central-1b"
          + "deleteme"                     = "true"
          + "kubernetes.io/cluster/stackx" = "shared"
          + "kubernetes.io/role/elb"       = "1"
          + "managedby"                    = "terratest"
          + "owner"                        = "terraform-aws-terratest"
          + "project"                      = "stackx"
          + "test"                         = "true"
          + "workspace"                    = "terratest"
        }
      + tags_all                                       = {
          + "Access"                       = "public"
          + "Name"                         = "public-eu-central-1b"
          + "deleteme"                     = "true"
          + "kubernetes.io/cluster/stackx" = "shared"
          + "kubernetes.io/role/elb"       = "1"
          + "managedby"                    = "terratest"
          + "owner"                        = "terraform-aws-terratest"
          + "project"                      = "stackx"
          + "test"                         = "true"
          + "workspace"                    = "terratest"
        }
      + vpc_id                                         = (known after apply)

      + timeouts {
          + delete = "30m"
        }
    }

  # module.stackx-network.aws_subnet.public["c"] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.200.0/22"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Access"                       = "public"
          + "Name"                         = "public-eu-central-1c"
          + "deleteme"                     = "true"
          + "kubernetes.io/cluster/stackx" = "shared"
          + "kubernetes.io/role/elb"       = "1"
          + "managedby"                    = "terratest"
          + "owner"                        = "terraform-aws-terratest"
          + "project"                      = "stackx"
          + "test"                         = "true"
          + "workspace"                    = "terratest"
        }
      + tags_all                                       = {
          + "Access"                       = "public"
          + "Name"                         = "public-eu-central-1c"
          + "deleteme"                     = "true"
          + "kubernetes.io/cluster/stackx" = "shared"
          + "kubernetes.io/role/elb"       = "1"
          + "managedby"                    = "terratest"
          + "owner"                        = "terraform-aws-terratest"
          + "project"                      = "stackx"
          + "test"                         = "true"
          + "workspace"                    = "terratest"
        }
      + vpc_id                                         = (known after apply)

      + timeouts {
          + delete = "30m"
        }
    }

  # module.stackx-network.aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = true
      + cidr_block                           = "10.1.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-network"
          + "Module"   = "terraform-aws-stackx-network"
          + "Name"     = "stackx-0-network"
          + "deleteme" = "true"
          + "test"     = "true"
        }
      + tags_all                             = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-network"
          + "Module"   = "terraform-aws-stackx-network"
          + "Name"     = "stackx-0-network"
          + "deleteme" = "true"
          + "test"     = "true"
        }
    }

  # module.stackx-network.aws_vpc_endpoint.s3[0] will be created
  + resource "aws_vpc_endpoint" "s3" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-central-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-network"
          + "Module"   = "terraform-aws-stackx-network"
          + "Name"     = "stackx-0-network-s3"
          + "deleteme" = "true"
          + "test"     = "true"
        }
      + tags_all              = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-network"
          + "Module"   = "terraform-aws-stackx-network"
          + "Name"     = "stackx-0-network-s3"
          + "deleteme" = "true"
          + "test"     = "true"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

  # module.stackx-network.aws_vpc_endpoint_route_table_association.private_s3[0] will be created
  + resource "aws_vpc_endpoint_route_table_association" "private_s3" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.stackx-network.aws_vpc_endpoint_route_table_association.private_s3[1] will be created
  + resource "aws_vpc_endpoint_route_table_association" "private_s3" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.stackx-network.aws_vpc_endpoint_route_table_association.private_s3[2] will be created
  + resource "aws_vpc_endpoint_route_table_association" "private_s3" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

Plan: 50 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_endpoint = (known after apply)
  + cluster_name     = "stackx-cluster-f2f6c971-6a3c-4d"
  + k8s_version      = "1.27"
  + oidc_issuer      = (known after apply)
  + oidc_issuer_arn  = (known after apply)
  + platform_version = (known after apply)

```

</details>

*Pushed by: @hajowieland, Action: `pull_request`*